name: "cellpose-onnx"
backend: "python"

input [
  {
    name: "images"
    data_type: TYPE_FP32
    dims: [ -1, -1, -1 ]
  }
]
output [
  {
    name: "masks"
    data_type: TYPE_FP32
    dims: [ -1, -1 ]
  }
]

instance_group [{ kind: KIND_GPU }]

parameters: {
  key: "EXECUTION_ENV_PATH",
  value: {string_value: "/models/cellposelite-onnxruntime-gpu.tar.gz"}
}
